princeton/ipvs/results/timeseries/time-scales/1_X_max/single-backend/500ms-fluctuation/3mins-run/1ms-feedback/wlc/3333-seed/run/httperf_client_121.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=8 --send-buffer=4096 --recv-buffer=16384 --num-conns=1440 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 36
            11.5 310
            12.5 255
            13.5 158
            14.5 75
            15.5 120
            16.5 158
            17.5 119
            18.5 82
            19.5 43
            20.5 24
            21.5 15
            22.5 8
            23.5 5
            24.5 2
            25.5 1
            26.5 1
             :
            28.5 1
             :
            33.5 1
             :
           166.5 1
             :
           178.5 1
             :
           184.5 1
           185.5 1
             :
           188.5 1
             :
           192.5 3
             :
           194.5 1
             :
           198.5 1
             :
           200.5 1
             :
           204.5 1
           205.5 1
             :
           228.5 1
             :
           250.5 1
             :
           262.5 1
             :
           271.5 1
             :
           278.5 1
             :
           280.5 1
             :
           288.5 1
           289.5 1
             :
           316.5 1
             :
           327.5 1
             :
           329.5 1
             :
           336.5 1
             :
           379.5 1

Total: connections 1440 requests 1440 replies 1440 test-duration 179.891 s

Connection rate: 8.0 conn/s (124.9 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 10.3 avg 18.6 max 379.9 median 13.5 stddev 31.6
Connection time [ms]: connect 0.8
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (124.9 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 7.0 avg 8.0 max 9.0 stddev 0.3 (179 samples)
Percentages of the replies served at a given rate:
   50%: 7
   66%: 7
   75%: 7
   80%: 7
   90%: 7
   95%: 7
   98%: 8
   99%: 8
  100%: 9

Reply time [ms]: response 17.2 transfer 0.5
Percentages of the requests served within a certain time (ms) :
   50%: 12
   66%: 14
   75%: 15
   80%: 15
   90%: 17
   95%: 18
   98%: 22
   99%: 196
  100%: 379

Reply size [B]: header 162.0 content 72.0 footer 1.0 (total 235.0)
Reply status: 1xx=0 2xx=1440 3xx=0 4xx=0 5xx=0

CPU time [s]: user 154.00 system 25.60 (user 85.6% system 14.2% total 99.8%)
Net I/O: 2.4 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0